## Initial preparations: importing libraries and files locations

In [3]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [5]:
# Define path
path = r'/Users/d_matos/Desktop/Career Foundry/4. Python Fundamentals for Data Analysts/Instacart Basket Analysis'

## Dataframe1: Customer

In [7]:
#Import new dataframe
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [9]:
df_customers.shape

(206209, 10)

In [11]:
df_customers.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [13]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
# Renaming columns
df_customers.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'surname', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age'}, inplace = True)

In [17]:
df_customers.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [19]:
# Checking data types
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   first_name    194950 non-null  object
 2   surname       206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [21]:
#Looking into more detail on the First Names column
df_customers['first_name'].value_counts(dropna = False)

first_name
NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

In [23]:
#Looking into more detail on the NaNs
nan_first_names = df_customers[df_customers['first_name'].isna()]

In [25]:
nan_first_names

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [27]:
# Replace NaN values in the 'first_name' column with 'unknown_name'
df_customers['first_name'] = df_customers['first_name'].replace(np.nan, 'unknown_name')

In [29]:
# Verify the changes
df_customers['first_name'].value_counts(dropna=False)

first_name
unknown_name    11259
Marilyn          2213
Barbara          2154
Todd             2113
Jeremy           2104
                ...
Merry             197
Eugene            197
Garry             191
Ned               186
David             186
Name: count, Length: 208, dtype: int64

In [31]:
# Changing 'first_name' column to string (instead of object)
df_customers['first_name'] = df_customers['first_name'].astype(str)

In [33]:
df_customers.dtypes

user_id          int64
first_name      object
surname         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [35]:
#Still checking, but i can see now that object and string are interchangeable in python
data_types = df_customers['first_name'].apply(type)

In [37]:
data_types.value_counts()

first_name
<class 'str'>    206209
Name: count, dtype: int64

In [39]:
#Went back to see how i did it in 4.5, and really found this useful!
for col in df_customers.columns.tolist():
    if len (df_customers[col].apply(type).unique()) > 1:
        print('this column has mixed-type data')
    else:
        print(col+' no mixed-type data here, yeaaaah')

user_id no mixed-type data here, yeaaaah
first_name no mixed-type data here, yeaaaah
surname no mixed-type data here, yeaaaah
gender no mixed-type data here, yeaaaah
state no mixed-type data here, yeaaaah
age no mixed-type data here, yeaaaah
date_joined no mixed-type data here, yeaaaah
n_dependants no mixed-type data here, yeaaaah
fam_status no mixed-type data here, yeaaaah
income no mixed-type data here, yeaaaah

In [41]:
#Check for duplicates
duplicates = df_customers[df_customers.duplicated()]

In [43]:
duplicates

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

In [47]:
#No duplicates!

In [45]:
df_customers.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

## Dataframe 2: orders_products_merged_derived_aggregated (henceforth df49)

In [47]:
df49 = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_derived_aggregated_twice.pkl'))

In [59]:
df49.shape

(32404859, 22)

In [51]:
df49.columns

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', '_merge', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'busiest_day',
       'max_order', 'loyalty_flag', 'average_spend', 'spending_flag',
       'median_frequency', 'frequency_flag'],
      dtype='object')

In [53]:
df49.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,department_id,prices,price_range_loc,busiest_day,max_order,loyalty_flag,average_spend,spending_flag,median_frequency,frequency_flag
0,2539329,1,1,2,8,7.0,196,1,0,both,...,7,9.0,Mid-range product,Regularly busy,10,New customer,6.367797,Low spender,20.0,Regular customer
1,2539329,1,1,2,8,7.0,14084,2,0,both,...,16,12.5,Mid-range product,Regularly busy,10,New customer,6.367797,Low spender,20.0,Regular customer
2,2539329,1,1,2,8,7.0,12427,3,0,both,...,19,4.4,Low-range product,Regularly busy,10,New customer,6.367797,Low spender,20.0,Regular customer
3,2539329,1,1,2,8,7.0,26088,4,0,both,...,19,4.7,Low-range product,Regularly busy,10,New customer,6.367797,Low spender,20.0,Regular customer
4,2539329,1,1,2,8,7.0,26405,5,0,both,...,17,1.0,Low-range product,Regularly busy,10,New customer,6.367797,Low spender,20.0,Regular customer

## Merging

In [55]:
df410 = df_customers.merge(df49, on = 'user_id')

In [57]:
df410.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'fam_status', 'income', 'order_id',
       'order_number', 'order_day_of_week', 'order_hour_of_day',
       'days_since_prior_order', 'product_id', 'add_to_cart_order',
       'reordered', '_merge', 'product_name', 'aisle_id', 'department_id',
       'prices', 'price_range_loc', 'busiest_day', 'max_order', 'loyalty_flag',
       'average_spend', 'spending_flag', 'median_frequency', 'frequency_flag'],
      dtype='object')

In [61]:
df410.shape

(32404859, 31)

# Exporting the merged dataframe

In [ ]:
df410.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'merged_final.pkl'))